# Panda SQL

In [1]:
import pandas as pd
import sqlalchemy

In [3]:
!pip install pymysql

Collecting pymysql
  Downloading PyMySQL-0.9.3-py2.py3-none-any.whl (47 kB)
Installing collected packages: pymysql
Successfully installed pymysql-0.9.3

In [5]:
# engine de conex√£o do mysql 

engine = sqlalchemy.create_engine('mysql+pymysql://root:Salmos4;1@localhost:3306/sakila')

**Metodo read_sql_table**

In [6]:
#P uxando a tabela COUNTRY 
df = pd.read_sql_table('country', engine)

C:\Users\santa\anaconda3\lib\site-packages\pymysql\cursors.py:170: Warning: (1366, "Incorrect string value: '\\xE3o de ...' for column 'VARIABLE_VALUE' at row 1")
  result = self._query(query)

In [7]:
df.head()

   country_id         country         last_update
0           1     Afghanistan 2006-02-15 04:44:00
1           2         Algeria 2006-02-15 04:44:00
2           3  American Samoa 2006-02-15 04:44:00
3           4          Angola 2006-02-15 04:44:00
4           5        Anguilla 2006-02-15 04:44:00

In [8]:
#Puxando a um coluna de uma tabela

df = pd.read_sql_table('country', engine, columns=["country_id","country"])

In [9]:
df.head()

   country_id         country
0           1     Afghanistan
1           2         Algeria
2           3  American Samoa
3           4          Angola
4           5        Anguilla

**Metodo read_sql_query**

In [10]:
#Criando um Dataframe a partir de uma query no banco com sql

df = pd.read_sql_query("select * from country", engine)

In [11]:
df.head()

   country_id         country         last_update
0           1     Afghanistan 2006-02-15 04:44:00
1           2         Algeria 2006-02-15 04:44:00
2           3  American Samoa 2006-02-15 04:44:00
3           4          Angola 2006-02-15 04:44:00
4           5        Anguilla 2006-02-15 04:44:00

In [13]:
#Criando um Dataframe a partir de uma query no banco com sql usando e indexando por uma coluna especifica

df = pd.read_sql_query("select * from country", engine, index_col='country_id')

In [14]:
df.head()

                   country         last_update
country_id
1              Afghanistan 2006-02-15 04:44:00
2                  Algeria 2006-02-15 04:44:00
3           American Samoa 2006-02-15 04:44:00
4                   Angola 2006-02-15 04:44:00
5                 Anguilla 2006-02-15 04:44:00